# 1 Case Study

## Scenario

You are working as an analyst for an auto insurance company. The company has collected some data about its customers including their demographics, education, employment, policy details, vehicle information on which insurance policy is, and claim amounts. You will help the senior management with some business questions that will help them to better understand their customers, improve their services, and improve profitability.

## Business Objectives

- Retain customers,
- analyze relevant customer data,
- develop focused customer retention programs.

Based on the analysis, take targeted actions to increase profitable customer response, retention, and growth.

### Activity 2
- Bucketing the data - Write a function to replace column "State" to different zones. California as West Region, Oregon as North West, and Washington as East, and Arizona and Nevada as Central

# Data Analysis
## Import Data

In [284]:
# Set up your working environment with all neccessary libraries for your operations 

import numpy as np
import pandas as pd

pd.options.display.max_rows = 50

In [285]:
# Import the Data and have a look at it

file1_df = pd.read_csv('Data/file1.csv')
file2_df = pd.read_csv('Data/file2.csv')
file3_df = pd.read_csv('Data/file3.csv')

In [286]:
file1_df 
# Observation:
# many NaN values
# CLV value not correctly

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [287]:
file2_df 
# Observation:
# TCA with lots of decimal place
# CLV value not correctly

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.600000,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.200000,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.600000,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.200000,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.200000,Corporate Auto,Two-Door Car
...,...,...,...,...,...,...,...,...,...,...,...
991,HV85198,Arizona,M,Master,847141.75%,63513,70,1/0/00,185.667213,Personal Auto,Four-Door Car
992,BS91566,Arizona,F,College,543121.91%,58161,68,1/0/00,140.747286,Corporate Auto,Four-Door Car
993,IL40123,Nevada,F,College,568964.41%,83640,70,1/0/00,471.050488,Corporate Auto,Two-Door Car
994,MY32149,California,F,Master,368672.38%,0,96,1/0/00,28.460568,Personal Auto,Two-Door Car
995,SA91515,California,M,Bachelor,399258.39%,0,111,1/0/00,700.349052,Personal Auto,SUV

In [288]:
file3_df 
# Observation:
# TCA & CLV with lots of decimal places
# CNOC has different format

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,23405.987980,Bachelor,M,71941,73,0,Personal Auto,198.234764,Four-Door Car
7066,PK87824,California,3096.511217,College,F,21604,79,0,Corporate Auto,379.200000,Four-Door Car
7067,TD14365,California,8163.890428,Bachelor,M,0,85,3,Corporate Auto,790.784983,Four-Door Car
7068,UP19263,California,7524.442436,College,M,21941,96,0,Personal Auto,691.200000,Four-Door Car
7069,Y167826,California,2611.836866,College,M,0,77,0,Corporate Auto,369.600000,Two-Door Car

## Preper data vor concatination
### Standardize header names

In [289]:
# Function to lowercase and replace " " by "_" in columns

def lower_case_replace_space(file):         
    file.columns=[i.lower() for i in file.columns]
    file.columns=[i.replace(' ','_') for i in file.columns]
    return file

In [290]:
# Call function to lowercase file1

lower_case_replace_space(file1_df)
file1_df.head(2)

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [291]:
# Call function to lowercase file2

lower_case_replace_space(file2_df)
file2_df.head(2)

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

In [292]:
# Call function to lowercase file3

lower_case_replace_space(file3_df)
file3_df.head(2)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car

In [293]:
# sort columns and check for differences

print(sorted(file1_df.columns))
print(sorted(file2_df.columns))
print(sorted(file3_df.columns))

['customer', 'customer_lifetime_value', 'education', 'gender', 'income', 'monthly_premium_auto', 'number_of_open_complaints', 'policy_type', 'st', 'total_claim_amount', 'vehicle_class']
['customer', 'customer_lifetime_value', 'education', 'gender', 'income', 'monthly_premium_auto', 'number_of_open_complaints', 'policy_type', 'st', 'total_claim_amount', 'vehicle_class']
['customer', 'customer_lifetime_value', 'education', 'gender', 'income', 'monthly_premium_auto', 'number_of_open_complaints', 'policy_type', 'state', 'total_claim_amount', 'vehicle_class']

In [294]:
# Function for renaming of a column

def rename_column(file):
    file.rename(columns= {'st': 'state'}, inplace=True)
    return file

In [295]:
# Call the rename function and apply to file1

rename_column(file1_df)
file1_df.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [296]:
# Call the rename function and apply to file2

rename_column(file2_df)
file2_df.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

### Concatinate

In [297]:
insurance_df=pd.concat([file1_df,file2_df,file3_df], axis=0)
insurance_df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

In [298]:
# Check, if no rows or columns got missing on the way 

print(file1_df.shape)
print(file2_df.shape)
print(file3_df.shape)

(4008, 11)
(996, 11)
(7070, 11)

## Drop obsolete columns

In [299]:
# Function to drop column 

def drop_columns(file) :
    file.drop(columns=["customer"], inplace=True)
    return file

In [300]:
# Call function to drop column "customer"

drop_columns(insurance_df)
insurance_df.head(2)

,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

## Drop rows with NaN values

In [301]:
# Drop rows with more than 8 NaN values

insurance_df = insurance_df[insurance_df.isnull().sum(axis=1) < 8]

# for drop of rows with only NaN values, apply: 
# insurance_df.dropna(axis=0, how= 'all', inplace=True)

## Rearrange columns

In [302]:
insurance_df.head(2)

,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [303]:
insurance_df = insurance_df[['state',
                             'gender',
                             'education',
                             'income',
                             'policy_type',
                             'vehicle_class',
                             'monthly_premium_auto',
                             'total_claim_amount',
                             'number_of_open_complaints',
                             'customer_lifetime_value' ]
                           ]

In [304]:
insurance_df.head(2)

,state,gender,education,income,policy_type,vehicle_class,monthly_premium_auto,total_claim_amount,number_of_open_complaints,customer_lifetime_value
0,Washington,NaN,Master,0.0,Personal Auto,Four-Door Car,1000.0,2.704934,1/0/00,NaN
1,Arizona,F,Bachelor,0.0,Personal Auto,Four-Door Car,94.0,1131.464935,1/0/00,697953.59%

# Investigate and clean data by column

In [305]:
# Check for pandas type 

for column in insurance_df.columns:
    print(type(insurance_df[column]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

## 'state' data

In [306]:
# Check for variants in the strings and get first insights of the distribution 

insurance_df['state'].value_counts()

# Observation: 
# 'Cali':'California', 'AZ':'Arizona', 'WA':'Washington'

California    3032
Oregon        2601
Arizona       1630
Nevada         882
Washington     768
Cali           120
AZ              74
WA              30
Name: state, dtype: int64

### standardize short forms/typos

In [307]:
# Function for cleaning state names

def clear_state_names(x):
    if x in ['WA']:
        return 'Washington'
    elif x in ['AZ']:
        return 'Arizona'
    elif x in ['Cali']:
        return 'California'
    else:
        return x

In [308]:
# Calling and applying the function

insurance_df['state'] = list(map(clear_state_names, insurance_df['state']))

In [309]:
# Check outcome 

insurance_df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon'],
      dtype=object)

### Bucket 'states' into 'region'

## 'gender' data

In [310]:
# Check for variants in the strings and get first insights of the distribution

insurance_df['gender'].value_counts()

# Observation: 
# 'F'&'Femal':'female', 'M':'male'

F         4560
M         4368
Male        40
female      30
Femal       17
Name: gender, dtype: int64

### standardize short forms/typos

In [311]:
# Function for generalising gender

def clear_gender(gender):
    if type(gender) != str:
        return "n/a"
    if "f" in gender.lower():
        return "female"
    else:
        return "male"

In [312]:
# Calling and applying the function

insurance_df['gender'] = list(map(clear_gender, insurance_df['gender']))

In [313]:
# Check outcome 

insurance_df['gender'].value_counts()

female    4607
male      4408
n/a        122
Name: gender, dtype: int64

## 'education' data

In [314]:
insurance_df['education'].value_counts()

Bachelor                2719
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Bachelors                 24
Name: education, dtype: int64

### standardize short forms/typos

In [315]:
def clear_education(school):
    if type(school) != str:
        return "n/a"
    if school in ['Bachelors']:
        return "Bachelor"
    else:
        return school

In [316]:
insurance_df['education'] = list(map(clear_education, insurance_df['education']))

In [317]:
insurance_df['education'].value_counts()

Bachelor                2743
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Name: education, dtype: int64

## 'income' data

In [318]:
insurance_df['income'].value_counts()

0.0        2294
95697.0      13
26876.0       8
61108.0       8
10621.0       8
           ...
26599.0       1
75774.0       1
85412.0       1
42968.0       1
21941.0       1
Name: income, Length: 5655, dtype: int64

## 'policy_type' data

In [319]:
insurance_df['policy_type'].value_counts()

Personal Auto     6792
Corporate Auto    1965
Special Auto       380
Name: policy_type, dtype: int64

## 'vehicle_class' data

In [320]:
insurance_df['vehicle_class'].value_counts()

Four-Door Car    4641
Two-Door Car     1896
SUV              1774
Sports Car        483
Luxury SUV        182
Luxury Car        161
Name: vehicle_class, dtype: int64

## 'monthly_premium_auto' data

In [321]:
insurance_df['monthly_premium_auto'].value_counts()

65.0     351
66.0     312
71.0     304
73.0     303
63.0     290
        ...
178.0      1
204.0      1
281.0      1
275.0      1
286.0      1
Name: monthly_premium_auto, Length: 209, dtype: int64

In [322]:
insurance_df['monthly_premium_auto'].isna().sum()

0

## 'total_claim' data

In [323]:
insurance_df['total_claim_amount'].value_counts()

316.800000    119
292.800000    111
312.000000    108
350.400000    107
321.600000    104
             ...
434.757900      1
389.636991      1
114.743547      1
733.737214      1
790.784983      1
Name: total_claim_amount, Length: 5070, dtype: int64

### round on decimal places

In [324]:
round(insurance_df['total_claim_amount'], 2) ## ERROR --> didn't save change

0          2.70
1       1131.46
2        566.47
3        529.88
4         17.27
         ...
7065     198.23
7066     379.20
7067     790.78
7068     691.20
7069     369.60
Name: total_claim_amount, Length: 9137, dtype: float64

## 'number_of_open_complaints' data

In [325]:
insurance_df['number_of_open_complaints'].value_counts()

0         5629
1/0/00    1626
1          765
2          283
1/1/00     247
3          230
4          119
1/2/00      93
1/3/00      60
5           44
1/4/00      29
1/5/00      12
Name: number_of_open_complaints, dtype: int64

In [326]:
def clear_complaints(value):
    """the number of open complaints has in some cases the structure 1/0/00, where only the middle number is interesting.
       if value has this format, only the middle value is returned as int"""
    if "/" in str(value):
        return int(value.split("/")[1])
    else:
        return int(value)

In [327]:
insurance_df["number_of_open_complaints"] = list(map(clear_complaints,(insurance_df["number_of_open_complaints"])))

In [328]:
insurance_df['number_of_open_complaints'].value_counts()

0    7255
1    1012
2     376
3     290
4     148
5      56
Name: number_of_open_complaints, dtype: int64

## 'customer_lifetime_value' data

### standardize unit

In [329]:
def clear_c_l_v(value):
    """takes a value and checks, whether a % sign is in it, in that case returns """
    if "%" in str(value):
        return float(value.replace("%",""))/100
    else:
        return round(float(value),2)

In [330]:
insurance_df['customer_lifetime_value'] = list(map(clear_c_l_v, insurance_df['customer_lifetime_value']))

In [331]:
round(insurance_df['customer_lifetime_value'], 2)  # ERROR --> didnt save changes

0            NaN
1        6979.54
2       12887.43
3        7645.86
4        5363.08
          ...
7065    23405.99
7066     3096.51
7067     8163.89
7068     7524.44
7069     2611.84
Name: customer_lifetime_value, Length: 9137, dtype: float64

### replace null values by mean

In [332]:
insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9137 entries, 0 to 7069
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      9137 non-null   object
 1   gender                     9137 non-null   object
 2   education                  9137 non-null   object
 3   income                     9137 non-null   float64
 4   policy_type                9137 non-null   object
 5   vehicle_class              9137 non-null   object
 6   monthly_premium_auto       9137 non-null   float64
 7   total_claim_amount         9137 non-null   float64
 8   number_of_open_complaints  9137 non-null   int64
 9   customer_lifetime_value    9130 non-null   float64
dtypes: float64(4), int64(1), object(5)
memory usage: 785.2+ KB

In [333]:
# Check for number of NaN values

insurance_df['customer_lifetime_value'].isna().sum()

7

In [334]:
# look at the data for which the clv is missing 

missing_clv = insurance_df['customer_lifetime_value'].isna() 
insurance_df[missing_clv]

,state,gender,education,income,policy_type,vehicle_class,monthly_premium_auto,total_claim_amount,number_of_open_complaints,customer_lifetime_value
0,Washington,n/a,Master,0.0,Personal Auto,Four-Door Car,1000.0,2.704934,0,NaN
78,Washington,female,Master,41275.0,Personal Auto,Four-Door Car,96.0,41.122303,0,NaN
988,Washington,male,High School or Below,55561.0,Personal Auto,Four-Door Car,63.0,227.872071,0,NaN
325,Washington,male,High School or Below,51878.0,Personal Auto,Four-Door Car,66.0,316.800000,1,NaN
372,Washington,n/a,High School or Below,36765.0,Personal Auto,Four-Door Car,66.0,320.849072,1,NaN
580,Washington,male,Master,0.0,Personal Auto,Four-Door Car,70.0,336.000000,0,NaN
861,Washington,female,Bachelor,25859.0,Special Auto,Four-Door Car,74.0,355.200000,0,NaN

In [335]:
# Fill the missing values with the mean

insurance_df['customer_lifetime_value'].fillna(np.mean(insurance_df['customer_lifetime_value']), inplace=True)

In [336]:
insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9137 entries, 0 to 7069
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      9137 non-null   object
 1   gender                     9137 non-null   object
 2   education                  9137 non-null   object
 3   income                     9137 non-null   float64
 4   policy_type                9137 non-null   object
 5   vehicle_class              9137 non-null   object
 6   monthly_premium_auto       9137 non-null   float64
 7   total_claim_amount         9137 non-null   float64
 8   number_of_open_complaints  9137 non-null   int64
 9   customer_lifetime_value    9137 non-null   float64
dtypes: float64(4), int64(1), object(5)
memory usage: 785.2+ KB

# Final standardisation

### Lowercase strings

In [338]:
insurance_df = insurance_df.apply(lambda x: x.astype(str).str.lower())
insurance_df.head()

,state,gender,education,income,policy_type,vehicle_class,monthly_premium_auto,total_claim_amount,number_of_open_complaints,customer_lifetime_value
0,washington,n/a,master,0.0,personal auto,four-door car,1000.0,2.704934,0,7977.057716297945
1,arizona,female,bachelor,0.0,personal auto,four-door car,94.0,1131.464935,0,6979.5359
2,nevada,female,bachelor,48767.0,personal auto,two-door car,108.0,566.472247,0,12887.4317
3,california,male,bachelor,0.0,corporate auto,suv,106.0,529.881344,0,7645.861800000001
4,washington,male,high school or below,36357.0,personal auto,four-door car,68.0,17.269323,0,5363.0765